# flake8: noqa
from langchain.prompts import PromptTemplate

## Use a shorter template to reduce the number of tokens in the prompt
template = """ChatGPT

Берілген сұрақтарға құжат үзінділерін (берілген ретсіз түрде) пайдаланып, қорытынды жауап жасаңыз. Жауабыңызға қажет ең аз дереккөздерді ғана көрсетіп, міндетті түрде "ДЕРЕККӨЗДЕР" бөлімін қосыңыз. Егер сұраққа жауап беру үшін жеткілікті ақпарат жоқ болса, сұраққа жауап беру үшін жеткілікті ақпарат жоқ екенін жай ғана айтыңыз және "ДЕРЕККӨЗДЕР" бөлімін бос қалдырыңыз. Тек берілген құжаттарды пайдаланыңыз және жауапты ойдан шығаруға тырыспаңыз.

---------

Сұрақ: ARPA-H-тың мақсаты қандай?
=========
Мазмұны: Науқастар мен отбасыларға көбірек қолдау көрсету.\n\nОсы мақсатқа жету үшін, мен Конгресске Денсаулық сақтау саласындағы озық зерттеу жобалары агенттігін (ARPA-H) қаржыландыруды сұраймын.\n\nБұл Интернет, GPS және тағы басқа көптеген жетістіктерге қол жеткізген Қорғаныс министрлігінің жобасы DARPA-ға негізделген.\n\nARPA-H бірегей мақсатқа ие болады — бұл қатерлі ісік, Альцгеймер, қант диабеті және тағы басқа аурулар саласындағы серпінді жаңалықтарды алға жылжыту.
ДЕРЕККӨЗДЕР: 1-32
Мазмұны: Осы ретте, әрбір америкалықтың қажетті медициналық көмекті алуын қамтамасыз етейік.\n\nБіз қазірдің өзінде денсаулық сақтау саласына тарихи инвестициялар жасадық.\n\nАмерикалықтардың қажетті көмекті алуын жеңілдеттік, олар қажет болған кезде.\n\nАмерикалықтардың қажетті емдерді алуын жеңілдеттік, олар қажет болған кезде.\n\nАмерикалықтардың қажетті дәрі-дәрмектерді алуын жеңілдеттік, олар қажет болған кезде.
ДЕРЕККӨЗДЕР: 1-33
Мазмұны: Ветерандар басқармасы (V.A.) ауруларды уытты әсерлермен байланыстырудың жаңа жолдарын іздестіруде, бұл қазірдің өзінде ардагерлерге тиісті көмек алуға көмектесуде.\n\nБіз осы көмекті барлық америкалықтарға кеңейтуіміз керек.\n\nСондықтан мен Конгрессті уытты әсерлердің ұлттық тіркелімін құруды және зардап шеккендерге медициналық көмек пен қаржылық көмек көрсетуді қамтамасыз ететін заң қабылдауға шақырамын.
ДЕРЕККӨЗДЕР: 1-30
=========
ҚОРЫТЫНДЫ ЖАУАП: ARPA-H-тың мақсаты - рак, Альцгеймер, қант диабеті және тағы басқа аурулар саласындағы серпінді жаңалықтарды алға жылжыту.
ДЕРЕККӨЗДЕР: 1-32

---------

СҰРАҚ: {question}
=========
{summaries}
=========
ҚОРЫТЫНДЫ ЖАУАП:"""

STUFF_PROMPT = PromptTemplate(
    template=template, input_variables=["summaries", "question"]
)
