# flake8: noqa
import streamlit as st


def faq():
    st.markdown(
        """
# FAQ
## PedagogGPT қалай жұмыс істейді?
Сіз құжатты жүктеген кезде, ол кішірек кесектерге бөлінеді және семантикалық іздеу мен іздестіру үшін арнайы деректер базасы деп аталатын векторлық индексте сақталады.

Сіз сұрақ қойған кезде, PedagogGPT құжат кесектерін іздестіреді және векторлық индексті пайдалана отырып ең өзектілерін табады. Содан кейін GPT-3 қолдану арқылы соңғы жауапты жасайды.

## Менің деректерім қауіпсіз бе?
Иә, сіздің деректеріңіз қауіпсіз. PedagogGPT сіздің құжаттарыңызды немесе сұрақтарыңызды сақтамайды. Барлық жүктелген деректер сіз браузер қойындысын жапқаннан кейін жойылады.

## Неліктен құжатты индекстеу ұзаққа созылады?
Егер сіз тегін OpenAI API кілтін қолдансаңыз, құжатты индекстеу біраз уақыт алады. Себебі тегін API кілтінде қатаң [шектеулер](https://platform.openai.com/docs/guides/rate-limits/overview) бар. Индекстеу процесін жылдамдату үшін ақылы API кілтін пайдалануға болады.

## Әрбір дереккөздің астындағы сандар нені білдіреді?
PDF құжаты үшін сіз осындай сілтеме нөмірін көресіз: 3-12. Бірінші сан - бет нөмірі, ал екінші сан - сол беттегі кесек нөмірі. DOCS және TXT құжаттары үшін бірінші сан 1 деп белгіленіп, екінші сан кесек нөмірі болып табылады.

## Жауаптар 100% дәл ме?
Жоқ, жауаптар 100% дәл емес. PedagogGPT жауаптарды жасау үшін GPT-3 қолданады. GPT-3 - қуатты тіл үлгісі, бірақ кейде қателіктер жібереді және қиялға бейім. Сондай-ақ, PedagogGPT ең өзекті кесектерді табу үшін семантикалық іздеуді қолданады және бүкіл құжатты көрмейді, бұл барлық маңызды ақпаратты табуға және барлық сұрақтарға жауап беруге мүмкіндік бермейді (әсіресе құжаттың көп контекстін талап ететін сұрақтар немесе қорытынды түріндегі сұрақтар).

Бірақ көпшілік жағдайлар үшін PedagogGPT өте дәл және көптеген сұрақтарға жауап бере алады. Жауаптардың дұрыс екендігіне көз жеткізу үшін әрқашан дереккөздермен тексеріңіз.
"""
    )
